[
    {
        "name": "Tutorial_First_Battle",
        "trigger": "combat_start",
        "level_nid": "0",
        "condition": "check_pair('Eirika','102') or check_pair('Seth','102')",
        "commands": [],
        "only_once": true,
        "priority": 20,
        "_source": [
            "if;game.game_vars['Tutorial'] == True",
            "speak;Narrator;               Combat Information;center;;narration_top",
            "add_portrait;Anna;Left",
            "speak;Anna;Okay!|Your first battle!|I believe in you!|I'll teach you some things before you get started, though!|Can you see that box over there?|Near your weapon!|It's got some useful info in it!|<red>HIT</> shows what percent chance your attack has to land.|<red>DMG</> shows how much that attack'll hurt when it lands!|<red>CRIT</> is another percentage!|This time, how likely it is your attack will do triple damage!|This is called a critical hit!|Certain skills work off of them!|And they make you look cool when performed...|If you have animations on, that is.|He he!",
            "else",
            "end",
            "if;game.game_vars['TutorialNewMech'] == True or game.game_vars['Tutorial'] == 'Yes'",
            "speak;Narrator;     Attack/Defense Stance/Affinity Strike;center;;narration_top",
            "add_portrait;Anna;Left",
            "speak;Anna;Y'know, there's a cool new system you should know about!|It's called <red>Pair-Up!</>|It lets your units team up in nifty ways, and has a few different flavors!|There's <red>Attack Stance</>, <red>Defense Stance</>, and the all-new <red>Affinity Strike!</>|<red>Attack Stance</> happens when two allies are adjacent.|Say, for instance, Units A and B are next to each other.|And a foe initiates against Unit A!|They'll be the primary combatant, sure...|But after their first attack, Unit B will pitch in, and strike the foe!|They'll only strike once per combat, however...|And the damage they deal is halved from what it'd be otherwise.|But it sure is handy for winning a fight!|Oh, and before I forget...|<red>Attack Stance</> won't happen while the enemy is in <red>Defense Stance</>.|<red>Defense Stance</> is a lot less incidental!|When you use <red>Pair-Up</> on two units, merging them into one team...|They automatically enter it during combat!|See that gauge down there?|While in <red>Defense Stance</>, every time they attack, or are attacked...|They gain 2 points! Up to a max of 10!|Once you hit 10, the next attack they take gets completely negated.|All thanks to the timely intervention of the main unit's pal, of course!|A couple of units paired up can also do something quite special...|It's called <red>Affinity Strike!</>|You can't just get it passively! Usually.|Instead, you have to manually activate it before entering combat!|You can't use it with a <red>Combat Art</>.|So be careful!|<red>Affinity Strike</> makes it so that, if you kill your foe...|You get to move again!|But it tires you out, so it's better to switch to your partner!|It also inflicts an affinity-based debuff to the foe after combat!|For example, if Seth was paired up with Eirika...|He'd inflict the Light Affinity debuff after combat!|You can tell what affinity strike you have based on your ally's Affinity.|Here's what each Affinity's status is...|And don't worry about memorizing it! You can always check later!|<red>Light</><icon>LightA</> reduces enemies' Hit by 60 for 2 turns.|This status is called Reduced Vision!|<red>Thunder</><icon>Thunder</> stuns the enemy for a turn.|This status is called...|Well, Stun.|<red>Dark</><icon>DarkA</> reduces the foe's Luck by 25%, their Crit Avoid by 10...|And makes Light weapons effective against them.|This lasts until their next combat, or for two turns: whatever comes first!|This status is called Shadowblight. But that's not all!|It also reduces their Res by 8 for one turn! Handy, eh?|That's a different status effect, called Cursed.|<red>Fire</><icon>Fire</>reduces the foe's Strength and Skill by 25%...|And makes Wind attacks effective against them!|This, too, lasts until their next combat or for two turns.|<red>Ice</><icon>Ice</> reduces the foe's Move and Speed by 25%...|And makes Heavy weapons effective against them!|Until, you guessed it, their next combat or two turns.|This status is called Frozen!|<red>Wind</><icon>Wind</> lowers their defense by 8 for a turn. Simple, huh?|That status is Breached. It's the Defense version of Cursed!|<red>Anima</><icon>Anima</> is a little special. It gives a random debuff!|This can include Seared, Cursed and Shadowblight, or Frozen...|But it also includes two more statuses!|Drenched, which is like Seared or Frozen...|Reducing Magic and Res by 25%, making Thunder attacks effective...|And lasting 2 turns or until the next combat, of course.|But the other one, Rock Punctures, is a bit trickier!|It reduces their Avoid by 60, their Def and Con by 25%...|And makes them take 25% of the damage they deal! Ow!|For the next combat or until two turns have passed, naturally.|And that's all of them!|Again, don't sweat memorizing it!|Just check the Guide later if you need!|Oh, one last thing.|Paired-up foes also have Affinity Strike...|But it's a bit different!|They get 50% bonus damage while paired up!|So be very careful against paired up enemies!|Remember!|If you're confused about Affinity Strike...|Check the Guide, or the unit's Skills tab!|You can access it by pressing <red>C</> over them, and scrolling a bit.|I hope that wasn't too much, he he!|Just experiment a bit. You'll find what works for you!",
            "else",
            "end",
            "remove_portrait;Anna"
        ],
        "nid": "0 Tutorial_First_Battle"
    }
]