[
    {
        "name": "Ch.13ABaseConvo1",
        "trigger": "on_base_convo",
        "level_nid": "13A",
        "condition": "unit == 'Mysteries of Magvel***'",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "transition;close;500",
            "change_background;Castle1",
            "#music;09 Distant Roads",
            "music;10- Rise Above Orchestral Cover;500",
            "transition;open;500",
            "multi_add_portrait;Saleh;MidRight;Lute;MidLeft",
            "expression;Lute;NoSmile",
            "speak;Lute;Excuse me.|Saleh, correct?|I've been told to come talk to you.|I've been researching these ancient texts on monsters and told you might have some insight.|My findings are quite remarkable, as one would expect from a prodigy such as myself.",
            "speak;Saleh;Interesting to hear.|I am willing to share my knowledge of monsters.|The monsters of Magvel do have a history as old as our continent itself.",
            "speak;Lute;Naturally, I've already documented this.|My research indicates that monsters weren't always prevalent.|I've determined that something must have triggered their emergence in cycles.",
            "speak;Saleh;Hmmmm....|In Caer Pelyn, we have tales of the Great Darkness.|A time when monsters roamed freely across all lands, before the Sacred Stones were created.|This could correlate with the cycles you mentioned.",
            "speak;Lute;Not only cycles, but what kind of monsters populate.|I've catalogued precisely 47 distinct species of monsters thus far.|No one else has achieved such comprehensive classification.|Each species seems to be drawn to different types of magical energy.",
            "speak;Saleh;Your work is thorough.|I've read scrolls suggesting that monsters are manifestations of dark magic.",
            "expression;Lute;Smile",
            "speak;Lute;Of course they're manifestations of dark magic.|I determined that conclusion months ago.|Though I must admit, your mountain village might have texts I haven't yet encountered.",
            "expression;Lute;NoSmile",
            "speak;Saleh;The texts speak of places where the veil between worlds is thin, drawing monsters to those locations.",
            "bop_portrait;Lute",
            "speak;Lute;That would explain their congregation near ancient ruins and temples.|But what of the <red>Gorgons</>?|Their petrification abilities cannot be explained by simple dark magic.|Even I find them... puzzling.",
            "speak;Saleh;The <red>Gorgons</> are indeed peculiar creatures.|Some believe they were once human mages who delved too deeply into forbidden arts.|Their transformation was the price of their hubris.",
            "speak;Lute;Hubris, you say?|An interesting cautionary tale, though not applicable to me.|My superior intellect allows me to navigate magical research without such risks.",
            "speak;Saleh;Even the most talented mages must exercise caution, Lute.|The line between brilliance and destruction can be thin.",
            "bop_portrait;Lute",
            "speak;Lute;I am aware of risks, Saleh.|I simply happen to be better equipped than most to handle them.|I'm particularly interested in the <red>Draco Zombies</>.|Their existence suggests that even wyverns can be corrupted by dark magic.",
            "speak;Saleh;The <red>Draco Zombies</> are troubling evidence of how far the corruption can spread.|Old stories speak of entire aerial legions transformed during the Demon King's first rise.",
            "speak;Lute;The relationship between monsters and the Demon King is clear to me now.|I've developed a theory that monsters predate the Demon King.|He merely harnessed what already existed.",
            "bop_portrait;Lute",
            "speak;Saleh;Your theory matches what I've heard before.|The monsters came first, then the Demon King united them.",
            "speak;Lute;It's gratifying to know my independent research matches other findings.|Though not surprising, given my exceptional analytical abilities.|I must reconsider my taxonomic classifications now.",
            "speak;Saleh;The natural order was disrupted when humans began to practice magic extensively.|People inadvertently strengthened the monsters by increasing magical energy in the world.",
            "expression;Lute;NoSmile",
            "speak;Lute;So humanity nearly destroyed itself through pursuit of knowledge.|Even I can appreciate the irony, though it won't deter my research.|Some risks are necessary for significant advancement.",
            "speak;Saleh;Knowledge itself is not the enemy.|It is how we use it that determines our fate.|That's why balance and restraint matter.",
            "expression;Lute;Smile",
            "speak;Lute;A fair point, Saleh.|While I'm confident in my abilities, I acknowledge there's wisdom in that approach.|With my intellect and your perspective, we might better understand how to predict another monster resurgence.",
            "speak;Saleh;That would be worthwhile.|Would you be interested in examining some of the texts I've collected?",
            "speak;Lute;Yes, I would find that valuable.|I'll prepare my cataloguing materials immediately.|This will undoubtedly be the most significant magical research undertaken in centuries.|And I'll be the one to complete it.",
            "remove_portrait;Lute",
            "remove_portrait;Saleh",
            "give_item;Lute;Secret_Book_Consumable",
            "give_item;Saleh;Secret_Book_Consumable",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "music_fade_back",
            "",
            "ignore_base_convo;Mysteries of Magvel***;t"
        ],
        "nid": "13A Ch.13ABaseConvo1"
    }
]