[
    {
        "name": "Outro",
        "trigger": "level_end",
        "level_nid": "15B",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "transition;close;500",
            "change_background;Desert",
            "transition;open;500",
            "#music;51 Victory",
            "music;51- Victory Orchestral Cover;500",
            "multi_add_portrait;Eirika;Right;Ephraim;Left",
            "move_portrait;Ephraim;MidLeft",
            "speak;Ephraim;Eirika!",
            "speak;Eirika;Brother!",
            "speak;Ephraim;You've done well, Eirika.",
            "speak;Eirika;Thanks to you, Ephraim.|Ah...|Wait a moment.|I've something to give you.",
            "speak;Ephraim;These are...",
            "speak;Eirika;These are the Sacred Twin relics of Jehanna.|The ice sword Audhulma and the wind blade Excalibur.",
            "speak;Ephraim;Jehanna's Sacred Twins?|But it seems like we were too late...|Jehanna Hall has fallen.",
            "speak;Eirika;Yes, and Queen Ismaire died resisting Grado.",
            "add_portrait;Larachel;FarLeft",
            "speak;Larachel;Now that we have, at last, been reunited once again, perhaps this would be a good time to share information.|I'm sure we all are most anxious to learn of what has happened.",
            "multi_remove_portrait;Larachel;Eirika;Ephraim",
            "give_item;Ephraim;Audhulma",
            "give_item;Ephraim;Excalibur",
            "transition;close;500",
            "change_background",
            "remove_all_units",
            "center_cursor;12,4;immediate",
            "transition;open;500",
            "flicker_cursor;8,8",
            "transition;close;500",
            "change_background;InsideFort_Bright",
            "transition;open;500",
            "multi_add_portrait;Eirika;FarLeft;Ephraim;MidLeft;Innes;MidRight;Larachel;FarRight",
            "speak;Ephraim;I see unfamiliar faces among you here, so allow me to introduce myself.|I am Ephraim, Eirika's brother and crown prince of Renais.",
            "speak;Larachel;I'm Princess L'Arachel of Rausten.|The pleasure is mine, of course.",
            "speak;Ephraim;I'll begin by telling you of how we've fared in our mission.|We seized the Grado capital and defeated their emperor, Vigarde.|Grado's capital guard have, to a man, surrendered and laid down their arms.|Pockets of resistance remain, but the war itself is over.",
            "speak;Innes;Is that so?",
            "speak;Ephraim;However, something remains that still bothers me.|A Grado man named Knoll told me about something called a Dark Stone.|Their mages had uncovered lore that led them to craft a powerful magic stone.|This Dark Stone may have been the catalyst of Grado's transformation.|It seems to be the source of that black wave of energy Myrrh described.|Vigarde died some time ago, but the power of the stone played him like a puppet.|The war and everything that passed since was planned by the Dark Stone's master.",
            "speak;Innes;Well?|Who is it?",
            "music_clear;300",
            "#music;45 Lost Heart;300",
            "music;45- Lost Heart Orchestral Cover;500",
            "speak;Ephraim;...I still can't believe it, but I'll tell you nonetheless.|According to Knoll, the man behind this is Lyon, the imperial prince.|He said Lyon's got the Dark Stone.",
            "speak;Innes;Figures it's Prince Lyon...",
            "speak;Eirika;No, that doesn't make any sense.|Ephraim and I know Lyon better than that.|We've been friends for years.|Lyon's not the sort of person who could start a war like this.",
            "speak;Innes;But, Eirika...",
            "speak;Eirika;I saw Lyon recently.|Ephraim, you might know this, but after I abandoned the sea route to Rausten, I traveled overland with Prince Innes to Jehanna.|We ran into trouble with Grado's forces, and I chanced upon Lyon.|He didn't share the details of his situation, but he intimated that he was on our side.|Despite all appearances, he was on our side.|So Lyon...",
            "speak;Ephraim;Eirika, I also met Lyon.",
            "speak;Eirika;Did you really?",
            "speak;Ephraim;Yes.|But, he was like a completely different person.|To be honest, he didn't seem to be completely...human.",
            "speak;Eirika;Ephraim... What are you saying?",
            "speak;Ephraim;I'll tell you what I saw.|I found Lyon inside Grado Keep.|This is what he told me.|He said he was behind this war.|He said he'd befriended us solely so that, one day, he could invade Renais...|He told me he killed our father.",
            "speak;Eirika;That...|That can't...",
            "speak;Ephraim;I know.|I can't believe it either.|I refuse to believe it.|How could he have planned all this since he was a child...|I simply can't fathom it.|I've heard Lyon changed when he acquired the Dark Stone.|I've no interest in magic, but...|There was something uncanny about him.|It seemed almost as though he were being controlled by something himself.",
            "speak;Eirika;......;no_talk",
            "speak;Innes;The two of you might find this hard to accept, but...|The state of Prince Lyon's heart matters little.|He has the Dark Stone.|That rock is the cause of all that's happened.|The prince must be stopped.",
            "music_clear;300",
            "#music;51 Victory;300",
            "music;51- Victory Orchestral Cover;500",
            "speak;Larachel;Not yet.|There is something that needs doing first.",
            "speak;Eirika;L'Arachel?",
            "speak;Larachel;Prince Ephraim, I do believe you felt it as well.|The Dark Stone held by Prince Lyon...|It exudes a malefic miasma...|We might be able to handle Prince Lyon alone, but that stone is beyond our ken.",
            "speak;Eirika;Then what do you suggest?",
            "speak;Larachel;The Sacred Stones.",
            "speak;Eirika;The Sacred Stones?",
            "speak;Larachel;We've all heard the legend of the five Sacred Stones.|They alone possessed the power to seal the Demon King away forever.|So, of course, to dispel demonic magic, we must use the Sacred Stones!",
            "speak;Innes;You expect us to pin the outcome of this war on some fool legend?",
            "speak;Ephraim;...Not just the legend.|We also have hope.|According to Lyon, he has already seen to the destruction of Grado's, Frelia's, and Jehanna's stones.",
            "speak;Eirika;Hm.|That explains something...|Grado forces attacked me, intent on destroying the Stone of Renais.|If that could be the reason they chose to invade Renais...|The power of the Sacred Stones may be greater than we'd ever known.",
            "speak;Larachel;Yes, exactly!|If we acquire a Sacred Stone, we'll be able to oppose the Dark Stone's might!",
            "speak;Innes;But three of the stones have been shattered, and our options are few.|Do you suppose that, during the invasion of Renais...",
            "speak;Ephraim;No, I don't think so.|The Stone of Renais is hidden by the power of Eirika's and my bracelets.",
            "speak;Eirika;Grado has made many attempts to take our bracelets.|Every one has failed, and so the stone may still be safe.",
            "speak;Ephraim;We have to confirm that, of course.|We've defeated Grado, and we must turn our eyes to our homeland.|It's time to return to Renais.",
            "multi_remove_portrait;Eirika;Ephraim;Innes;Larachel",
            "transition;close;500",
            "transition;open;500",
            "multi_add_portrait;Myrrh;Left;Saleh;FarRight",
            "move_portrait;Saleh;Right",
            "speak;Saleh;Lady Myrrh.",
            "speak;Myrrh;Saleh...",
            "speak;Saleh;I'm grateful to see you well.|The people of Caer Pelyn will be overjoyed that you're safe.",
            "speak;Myrrh;I must apologize to you, Saleh.|You were there to protect me from the very start of my journey.|When we were attacked, I was separated from you, and...|I'm so sorry to have worried you.",
            "speak;Saleh;Lady Myrrh.|As long as you are safe, we have nothing to be worried about.|It will be my honor to serve you until your mission is complete.",
            "speak;Myrrh;Thank you, Saleh.",
            "multi_remove_portrait;Myrrh;Saleh",
            "transition;close;500",
            "music_clear;500"
        ],
        "nid": "15B Outro"
    }
]