[
    {
        "name": "Ch16ABaseConvo4",
        "trigger": null,
        "level_nid": "16A",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "transition;close;500",
            "change_background;Camp_Tent",
            "#music;09 Distant Roads",
            "music;09- Distant Roads Orchestral Cover",
            "transition;open;500",
            "multi_add_portrait;Moulder;MidLeft;Saleh;MidRight",
            "",
            "speak;Moulder;*sigh*|Another day goes by and the war still wages on....",
            "",
            "speak;Saleh;The last few battles have been difficult.|Their forces were well-coordinated.",
            "",
            "speak;Moulder;It wasn't just their warriors that troubled us.|Did you notice their staff wielders?|The precision of their hexes was... unsettling.",
            "",
            "speak;Saleh;Yes.|The thunder staff they used on Sir Gilliam nearly led to disaster.",
            "speak;Moulder;He was charging directly at the enemy and almost got hit.|And that fire staff they used on General Seth...|If Natasha hadn't been nearby with a healing staff...",
            "",
            "speak;Saleh;Their range is concerning as well.|They can cast from positions we cannot easily reach.",
            "",
            "speak;Moulder;In all my years serving Renais, I've never encountered magic users with such deadly efficiency.|It's as if they can sense our vulnerabilities from afar.",
            "speak;Saleh;The ancient texts of Caer Pelyn speak of such practitioners.|Those who forge a connection with their targets across great distances.",
            "",
            "speak;Moulder;Is there a way to counter such abilities?|Our healing staves help after the fact, but...|I would prefer to prevent these afflictions entirely.",
            "",
            "speak;Saleh;There are methods.|Magical resistance can be cultivated through certain practices.",
            "",
            "speak;Moulder;Truly?|Please, Master Saleh, any wisdom you could share would be invaluable.",
            "",
            "speak;Saleh;The training would take years.|We don't have that luxury in our current circumstances.",
            "expression;Moulder;HalfCloseEyes",
            "",
            "speak;Moulder;I see.|Then we must continue to react rather than prevent.",
            "",
            "speak;Saleh;Not necessarily.|There is... another option.",
            "expression;Moulder;NormalBlink",
            "speak;Moulder;Oh?",
            "",
            "speak;Saleh;When I departed from Caer Pelyn, my grandmother insisted I take this.",
            "",
            "speak;Saleh;She foresaw that dark forces would attempt to control the minds of our allies.",
            "speak;Moulder;What is it that she gave you?",
            "",
            "speak;Saleh;This.",
            "",
            "speak;Moulder;A staff?|But it's unlike any I've seen before...|The crystal at its peak seems to shimmer with an inner light.",
            "",
            "speak;Saleh;It is a barrier staff.|Ancient in design, crafted by the sages of Caer Pelyn centuries ago.",
            "speak;Saleh;When activated, it creates a protective field around our allies.|It strengthens their resistance to magical influence.",
            "",
            "speak;Moulder;Such a tool would be invaluable in our current struggles!|But surely you should be the one to wield it?|Your magical prowess far exceeds my own.",
            "",
            "speak;Saleh;No.|My role is elsewhere on the battlefield.|You, Father Moulder, are always positioned to observe our forces.",
            "speak;Saleh;You know better than anyone when our allies are most vulnerable.|When protection is most needed.",
            "",
            "speak;Moulder;I'm honored by your trust, Master Saleh.|But are you certain?|Such a rare artifact...",
            "",
            "speak;Saleh;I am certain.|Take it.|Use it to shield our companions from the enemy's influence.",
            "",
            "speak;Moulder;Then I accept this responsibility with the utmost gravity.|I swear by the sacred light that I will use it wisely.",
            "speak;Moulder;Thank you, Master Saleh.|Your generosity may well turn the tide of our coming battles.",
            "",
            "speak;Saleh;It is not generosity that motivates me, but necessity.|The darkness that pursues us grows stronger each day.",
            "speak;Saleh;We must use every tool at our disposal if we are to prevail.",
            "",
            "speak;Moulder;Indeed.|And with this barrier staff, we shall ensure that our minds remain our own.|Our wills unbent by enemy magic.",
            "speak;Saleh;The staff requires focus to use effectively.|I can show you the proper incantations before tomorrow's march.",
            "",
            "speak;Moulder;I would be most grateful for your instruction, Master Saleh.|Together, we shall protect our comrades from these insidious attacks.",
            "remove_portrait;Moulder",
            "remove_portrait;Saleh",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "music_fade_back",
            "",
            "ignore_base_convo;Minds Unbroken*;t"
        ],
        "nid": "16A Ch16ABaseConvo4"
    }
]