[
    {
        "name": "Ch16ABaseConvo1",
        "trigger": "on_base_convo",
        "level_nid": "16A",
        "condition": "unit == 'New Paths***'",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "transition;close;500",
            "change_background;Castle3",
            "#music;09 Distant Roads",
            "music;09- Distant Roads Orchestral Cover",
            "transition;open;500",
            "multi_add_portrait;Duessel;MidLeft;Knoll;MidRight",
            "",
            "",
            "speak;Duessel;Knoll, if I may ask...|What exactly was your position in Grado's court?|I've seen you studying those tomes at all hours.",
            "",
            "speak;Knoll;I was a researcher in the imperial magic academy.|My focus was primarily on ancient magic and its applications.",
            "",
            "speak;Knoll;His majesty, Vigarde allowed our research team certain... freedoms.|We explored magical frontiers that many would consider forbidden.",
            "speak;Duessel;I see.|King Vigarde always did have a keen interest in scholarship.|Though I admit, the magical arts have always been somewhat mysterious to me.",
            "",
            "speak;Duessel;Give me a good lance or axe, and I know exactly what to do.|But magic? Incantations and rituals?|I'm afraid I lack the talent entirely.",
            "",
            "speak;Knoll;With respect, General Duessel, I don't believe that's true.|Magic isn't merely an innate talent one is born with.",
            "speak;Knoll;Anyone can learn the fundamentals with proper study and practice.|It's a discipline, much like swordsmanship or tactics.",
            "",
            "bop_portrait;Duessel",
            "speak;Duessel;Is that so?|I've always been under the impression that one must have a certain... affinity for it.",
            "",
            "speak;Knoll;That is a common misconception.|Though I should warn you, magic is not to be taken lightly.",
            "speak;Knoll;The power to manipulate the fundamental forces of nature...|It can be intoxicating, even dangerous.|Many have been consumed by the very forces they sought to control.",
            "",
            "",
            "speak;Duessel;A sobering warning.|But you truly believe that even an old warhorse like myself could learn?|After all these years wielding steel instead of spells?",
            "",
            "bop_portrait;Knoll",
            "speak;Knoll;Age brings wisdom, General.|And wisdom is the foundation of true magical mastery.",
            "bop_portrait;Knoll",
            "speak;Knoll;Here.|This is a beginner's tome on elemental manifestation.|It's where all mages begin their journey.",
            "",
            "speak;Duessel;You would lend me such a book?|I'm not certain what use I would have for it, but...",
            "",
            "",
            "speak;Knoll;Try reading the first chapter before you sleep tonight.|The basic exercises require little more than concentration and breath control.",
            "speak;Knoll;You might be surprised at what you're capable of.",
            "",
            "speak;Duessel;Well, I suppose there's no harm in trying.|Though I must admit, I'm still skeptical.|These old hands have held weapons for decades...|I'm not sure they remember how to do much else.",
            "",
            "speak;Knoll;The mind is more adaptable than we give it credit for, General.|Even the oldest tree can grow new branches.",
            "expression;Duessel;Smile",
            "bop_portrait;Duessel",
            "speak;Duessel;Ha! A poetic sentiment.|Very well, Knoll. I accept your challenge.|I'll attempt these exercises, though I make no promises about the results.",
            "speak;Knoll;That's all I ask.|And should you have questions, I am at your disposal.",
            "speak;Duessel;I appreciate that.|This old dog may not learn new tricks easily...|But I've never been one to shy away from a challenge.",
            "",
            "speak;Duessel;Who knows?|Perhaps there's a mage hiding somewhere beneath all this armor.",
            "expression;Knoll;Smile",
            "",
            "speak;Knoll;Perhaps indeed, General.|Perhaps indeed.",
            "remove_portrait;Duessel",
            "remove_portrait;Knoll",
            "alert;Duessel's MAG and MAG growths went up!",
            "change_stats;Duessel;MAG,8",
            "change_growths;Duessel;MAG,30",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "music_fade_back",
            "increment_support_points;Duessel;Knoll;20",
            "ignore_base_convo;New Paths***;t"
        ],
        "nid": "16A Ch16ABaseConvo1"
    }
]