[
    {
        "name": "SupportInnesAndGerik",
        "trigger": "on_support",
        "level_nid": null,
        "condition": "check_pair('Innes','Gerik')",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "if;support_rank_nid == 'C'",
            "transition;close;500",
            "change_background;Bedroom",
            "transition;open;500",
            "multi_add_portrait;Innes;Left;Gerik;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Gerik;Hey, Prince!|How's it going?",
            "speak;Innes;Gerik...|I'm sorry you had to see that ugly side of me.",
            "speak;Gerik;Huh?|What do you mean?",
            "speak;Innes;At Renvall, when you stayed by me.|If not for your loyalty, I would have fallen into the hands of those mercenaries.",
            "speak;Gerik;Ah, well, that's my job, innit?|But what's your point?|This is unlike you, Prince.",
            "speak;Innes;I've guided men into battle countless times before that day.|I've always tried to be a model commander, to guide others by my example.|But...I found that many of my soldiers wanted a less severe example to follow.",
            "speak;Gerik;Ha ha ha...",
            "speak;Innes;But you're different.|I've known that from the day we first met.|How do you stay so composed in the heat of battle?",
            "speak;Gerik;I don't know how to answer that...|I suppose it's just in my nature.|Long discussions on the battlefield, however, are not.|Let's go already.",
            "speak;Innes;Ahh...",
            "multi_remove_portrait;Innes;Gerik",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank C!",
            "elif;support_rank_nid == 'B'",
            "transition;close;500",
            "change_background;Temple3",
            "transition;open;500",
            "multi_add_portrait;Innes;Left;Gerik;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Innes;Nice work, Gerik...|I see the Desert Tiger is still as fierce as ever.",
            "speak;Gerik;I can't believe my skill with the blade is known in circles as high as yours.|Let me tell you, I didn't get into this line of work because I like fighting.|It was a twist of fate that started me on this path...",
            "speak;Innes;Really?|But I've heard of your fame from no less a person than my father.|He tells me your name was once known from shore to shore on this continent.",
            "speak;Gerik;The past is the past.|I was just doing what I had to.|If I hadn't, I never would have survived.|But there's something about combat that just doesn't agree with my nature.",
            "speak;Innes;If that's the case, why are you with these mercenaries?",
            "speak;Gerik;Ahh...|The answer is so simple, you'll probably laugh.|Back when I was a kid, a friend from my village said he wanted to be a mercenary.|He said he was going to be famous, the greatest warrior in all the land.|No matter how many times I told him to give it up, he wouldn't listen to me.|Well, one day, he left for Jehanna.|I didn't know what else to do, so I went with him and joined the guild, too.|Stupid reason, isn't it?|Anyway...|I didn't particularly like fighting, and while I wasn't opposed to the money, I certainly wasn't in it for fame...|I just couldn't let my friend go off and get killed.",
            "speak;Innes;And where is this friend now?",
            "speak;Gerik;He went off and got killed.",
            "speak;Innes;I see...",
            "speak;Gerik;So there was no reason for me to continue being a mercenary...|But then there were other men who I considered to be my friends.|I couldn't bring myself to abandon them...|And so the years passed and here I am.|The thing is I can't stand to see my friends die.|But if you're in this business long enough, people around you get killed.|It happens.|The only thing you can do is keep moving forward and try not to think about it.|So...|Yes, I'd have a problem if you got yourself killed.|I've got no place else to go, and I'm tired of trying to forget.",
            "speak;Innes;Hmph...|Do you really think I'd lose so easily?|It won't do for you to underestimate me.",
            "speak;Gerik;Oh, uh...|Right.",
            "multi_remove_portrait;Innes;Gerik",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank B!",
            "elif;support_rank_nid == 'A'",
            "transition;close;500",
            "change_background;Forest3",
            "transition;open;500",
            "multi_add_portrait;Innes;Left;Gerik;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Innes;Gerik.",
            "speak;Gerik;Eh?",
            "speak;Innes;There's something I've always assumed to be true...|Those born to royalty cannot show others any weaknesses or deficiencies.|If they're not perfect at all times, their enemies will take advantage of them.",
            "speak;Gerik;Yeah?|So?",
            "speak;Innes;But meeting you has made me rethink that belief.|My father told me before I left that I should watch you and learn from you.|At the time, I believed there was nothing a mercenary could teach me.|Now I know better.|I am thankful to both my father and you.",
            "speak;Gerik;That's enough of that.|In my opinion, you're much finer than I could ever be.|The way you live, your manners, and your bearing...|I could never pull it off.",
            "speak;Innes;Me?|What do you mean?",
            "speak;Gerik;Look at you!|You're full of confidence.|You've got pride.|When I first met you, I thought,|“What a high-handed dandy.”",
            "speak;Innes;Did you just call me...a dandy?",
            "speak;Gerik;But that's just who you are.|Being proud is not always a bad thing.|You must have worked yourself near to death to preserve that pride.|What I mean is that you never make excuses for losing or being beaten up.|No matter the pain you face or hardship, you keep on fighting to honor that pride.|It's what defines you, and I can't say that I don't admire it.",
            "speak;Innes;It comes naturally.|I will be king one day, and I will make Frelia the greatest nation in all the world.|It will be a wonderful kingdom of wealth and power.|When that day comes, I will command you to become general and lead Frelia's armies.|No, I'll have you come and ask me to make you general.",
            "speak;Gerik;Ha ha ha!|I can't wait!",
            "multi_remove_portrait;Innes;Gerik",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank A!",
            "else",
            "alert;Support increased!",
            "end"
        ],
        "nid": "Global SupportInnesAndGerik"
    }
]