[
    {
        "name": "SupportCormagAndDuessel",
        "trigger": "on_support",
        "level_nid": null,
        "condition": "check_pair('Cormag','Duessel')",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "if;support_rank_nid == 'C'",
            "transition;close;500",
            "change_background;Temple3",
            "transition;open;500",
            "multi_add_portrait;Cormag;Left;Duessel;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Duessel;Cormag...",
            "speak;Cormag;Sir Duessel.",
            "speak;Duessel;Are you well?",
            "speak;Cormag;I am as you see me.|Fine in every respect.",
            "speak;Duessel;I'm not talking about your flesh.|It's your heart I'm worried for.",
            "speak;Cormag;......;no_talk",
            "speak;Duessel;I'm here because I made the decision for myself to leave Grado.|Luckily for me, one of the leaders here is an old acquaintance of mine.|I'm not saying my heart is at ease, but I have found something to believe in.|Something to fight for.|And yet, you...",
            "speak;Cormag;I, too, made a choice to be here.|There's no need for your concern.",
            "speak;Duessel;......;no_talk",
            "speak;Cormag;I believe in myself.|Therefore it matters not where I am.|So no matter where I go or what I do, I'm sure my brother would understand.",
            "speak;Duessel;Cormag.",
            "speak;Cormag;And besides, General Duessel, you're here in this army with me.|There's no shame in fighting alongside the man once known as Obsidian.",
            "speak;Duessel;Mm.|Cormag, let us emerge victorious from this war, for the things we both believe in.",
            "speak;Cormag;Yes.",
            "multi_remove_portrait;Cormag;Duessel",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank C!",
            "elif;support_rank_nid == 'B'",
            "transition;close;500",
            "change_background;Forest3",
            "transition;open;500",
            "multi_add_portrait;Duessel;Left;Cormag;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Cormag;Sir Duessel.",
            "speak;Duessel;Well met, Cormag.|I'm impressed by your skills.",
            "speak;Cormag;They're still far below yours, General Duessel.|By the way, I have a favor I've been meaning to ask of you.",
            "speak;Duessel;What is it?|Please tell me.",
            "speak;Cormag;Your stories tell of a small lance you carry like a treasure.|May I see it?",
            "speak;Duessel;Stories, you say?|Am I the subject of stories now?|Interesting.|Here is the lance you're talking about.|Examine it at your leisure.",
            "speak;Cormag;It...|It really is...|It's a Gavaleus...",
            "speak;Duessel;Oh!|You've heard of Gavaleus, have you?|You must know quite a bit about the crafting of weapons.|This is one of Gavaleus's final works.|I have quite a collection of weapons, but this is among the most beautiful of them.|While it can be used in battle, I would never dull its shine with blood or dirt.|If I ever use this lance, I vow that it will be only in my own final hour.",
            "speak;Cormag;It shines as though it could light up the soul of its wielder.|You're right.|I would hesitate to stain its beauty with blood, too.",
            "speak;Duessel;Ah, so you grasp what I mean?|Cormag, you have a discerning eye.",
            "speak;Cormag;Thank you.|And yet, I know that I will never be your equal, General Duessel.",
            "speak;Duessel;Come, now.|You know, your brother asked to see this lance once as well.",
            "speak;Cormag;My brother?",
            "speak;Duessel;Yes.|You two are so alike.|His comments mirror your own almost exactly.",
            "speak;Cormag;Is that so?",
            "speak;Duessel;For warriors, our weapons are our lives.|I'm glad to know you understand that.|Someday, you'll be a splendid wyvern knight to equal your brother.",
            "multi_remove_portrait;Cormag;Duessel",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank B!",
            "elif;support_rank_nid == 'A'",
            "transition;close;500",
            "change_background;GradoCastle",
            "transition;open;500",
            "multi_add_portrait;Duessel;Left;Cormag;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Duessel;Cormag...|I've something I want to show you.|Here it is.|This lance.|What do you think of it?",
            "speak;Cormag;My!|It has such power!|It sends chills down my spine...|I am not nearly strong enough to wield a weapon such as this.",
            "speak;Duessel;Hm, you think so?|Merely holding this lance makes me tremble with dread.|Not overly so, but enough to stop me from wielding it in combat.|This lance...|It can drive its wielder to madness.",
            "speak;Cormag;Madness, you say?",
            "speak;Duessel;Yes, Cormag.|It's a magic weapon of dark design that's been in my family for ages.|Legend states that the leader of our house must always carry it, but never use it.|We are prohibited from wielding it until such a time as madness itself rules the day.|It's part of my legacy, and yet...I...|I made a grave error...|I allowed Valter to use this lance.",
            "speak;Cormag;You let Valter–",
            "speak;Duessel;Yes...|...We were in the middle of a battle.|Valter had broken his lance, and when I wasn't looking he somehow took this one.|From that moment, he was changed...|He killed everyone–even retreating men.|I took the lance from him when I realized what had happened, but it was too late.|Madness had awakened within Valter and was coursing through his body.|From then on, he hungered only for battle and for blood...|It's not as though Valter was a gentle lamb before, but now his appetite for violence increased many times over.|It's all because of this cursed lance.",
            "speak;Cormag;......;no_talk",
            "speak;Cormag;That odd light playing around the point...|I thought it looked familiar.|It was Valter...|It's the same light Valter had in his eyes on the battlefield.|Valter's insane because of this lance.",
            "speak;Cormag;......;no_talk",
            "speak;Cormag;Sir Duessel, if it please you, would you let me have this lance?",
            "speak;Duessel;What?|You?|B-but...",
            "speak;Cormag;Are you worried that I will end up like Valter?",
            "speak;Duessel;N-no... ",
            "speak;Duessel;......;no_talk",
            "speak;Cormag;This lance–someone needs to master it.|It's just a feeling I have.|A weapon is only as good or evil as the man who wields it.|In the hands of someone just, it can be a righteous weapon.|In the hands of the wicked, it's a danger to all.|Believe me, I have not been seduced by this lance.|I merely want to see it used for the purpose for which it was forged.",
            "speak;Duessel;......;no_talk",
            "speak;Duessel;I understand you, Cormag.|I'm going to let you have it.|I have no son.|I had not yet decided to whom I should pass on this legacy.|Now I see that leaving it to someone whom I trust and believe in is best.|As with me, your admiration of weapons is balanced by a healthy respect.|You also have a good eye, and you possess tremendous strength.|The day you are able to wield this lance may not be far off at all.|If the madness in this lance can be tamed, it may very well be a weapon without equal.|...I never had the courage to wield it, but I would love to see it used righteously.|...I am entrusting it to you.|I hope you will use it one day.",
            "speak;Cormag;I accept your gift, Sir Duessel.|I would receive it once this battle is finished and our hearts are calmer.|If I were to take it in the heat of battle, I might become Valter the second.|It is a possibility that I cannot dismiss.",
            "speak;Duessel;Yes, I see.|Cormag...|I'm counting on you.|I look forward to the day I can see this lance wielded correctly.",
            "speak;Cormag;Understood.|Until that time comes, please try not to get yourself killed, General Duessel!",
            "speak;Duessel;Ha!",
            "multi_remove_portrait;Duessel;Cormag",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank A!",
            "else",
            "alert;Support increased!",
            "end"
        ],
        "nid": "Global SupportCormagAndDuessel"
    }
]