[
    {
        "name": "Ch20BBaseConvo3",
        "trigger": "on_base_convo",
        "level_nid": "20B",
        "condition": "unit == 'Scholarly Pursuits*'",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "transition;close;500",
            "change_background;Forest3",
            "#music;09 Distant Roads",
            "music;09- Distant Roads Orchestral Cover",
            "transition;open;500",
            "multi_add_portrait;Lute;MidLeft;Saleh;MidRight",
            "",
            "",
            "speak;Lute;According to my research, the <red>Cave Cleaver</> should be in this vicinity.|A fascinating specimen of Cyclops, by all accounts.",
            "expression;Saleh;NoSmile",
            "speak;Saleh;...I would advise against seeking out such a creature, Lute.|The elders of Caer Pelyn speak of it with great caution.",
            "speak;Lute;Caution is for those without superior intellect.|I am a prodigy, after all.|The opportunity to document such a rare monster is too valuable to ignore.",
            "speak;Saleh;The <red>Cave Cleaver</> is not merely a monster.|It is said to wield an axe forged from the bones of a dragon...|With each swing, it carves new tunnels through solid rock.",
            "expression;Lute;Smile",
            "bop_portrait;Lute",
            "speak;Lute;Yes!|Precisely why it's of such scientific interest!|Can you imagine the magical properties of such a weapon?|I've theorized that it must utilize a form of dark magic to alter the molecular structure of stone.",
            "speak;Saleh;It also utilizes that same power to alter the molecular structure of those unfortunate enough to encounter it.|There are no survivors in the stories for a reason.",
            "speak;Lute;Survivors make for incomplete data.|I shall be the first to document it properly.|Unlike others, I've prepared extensively.",
            "expression;Saleh;HalfCloseEyes",
            "speak;Saleh;Even the most thorough preparation may be insufficient.|My grandmother once told me that the creature was sealed away by the Great Dragon herself.|Some things are meant to remain undisturbed.",
            "bop_portrait;Lute",
            "speak;Lute;Myrrh's involvement is unexpected but makes perfect sense.|That would explain the residual magical signatures I detected earlier.|This discovery just became even more interesting!",
            "speak;Saleh;Lute, please.|This is not an academic exercise.|If the <red>Cave Cleaver</> still lives, it poses a genuine threat to all of Magvel.",
            "expression;Lute;NormalBlink",
            "speak;Lute;All the more reason to study it.|Knowledge is the most effective weapon against any threat.|Besides, I've already mapped out its probable lair based on geological formations.",
            "bop_portrait;Saleh",
            "speak;Saleh;...As your senior in magical studies, I must insist that we exercise extreme caution.|If we do encounter this creature, we retreat immediately.",
            "expression;Lute;NoSmile",
            "speak;Lute;Fine.|We'll retreat if necessary.|But first, I must collect at least some observational data.",
            "speak;Saleh;That is... acceptable.|But we approach only close enough to confirm its existence.|Nothing more.",
            "expression;Lute;Smile",
            "bop_portrait;Lute",
            "speak;Lute;Good!|Now, my calculations suggest we should proceed through that crevice.|The temperature drops in that direction, indicating a large subterranean chamber.",
            "speak;Saleh;...May the Great Dragon protect us from your curiosity, Lute.",
            "speak;Lute;Protection unnecessary.|Curiosity is what advances the field of magical study.|Now come along!|I've prepared seventeen different containment spells just in case!",
            "move_portrait;Lute;OffscreenLeft",
            "expression;Saleh;HalfCloseEyes",
            "speak;Saleh;.......|Grandmother Dara warned me about scholars like her.|I should have brought more elixirs.",
            "move_portrait;Saleh;OffscreenLeft",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "music_fade_back",
            "",
            "ignore_base_convo;Scholarly Pursuits*;t"
        ],
        "nid": "20B Ch20BBaseConvo3"
    }
]