[
    {
        "name": "SupportEphraimAndKyle",
        "trigger": "on_support",
        "level_nid": null,
        "condition": "check_pair('Ephraim','Kyle')",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "if;support_rank_nid == 'C'",
            "transition;close;500",
            "change_background;OutsideCastle",
            "transition;open;500",
            "multi_add_portrait;Ephraim;Left;Kyle;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Kyle;Prince Ephraim!",
            "speak;Ephraim;Kyle, what's the matter?",
            "speak;Kyle;Prince Ephraim...|You charged at the enemy line after you were injured, didn't you?",
            "speak;Ephraim;Oh, that?|That was nothing.|Don't worry about it.",
            "speak;Kyle;It's not the injury I'm worried about.|You're not supposed to do things like that!",
            "speak;Ephraim;If I retreat at the first scratch, command will fall apart.",
            "speak;Kyle;My lord, you are the future of Renais, the commander of this army.|If something were to happen to you, morale would be shattered.|We would lose this war.|All because of your misplaced pride.",
            "speak;Ephraim;Fine, Kyle.|I'll hang back and let you knights lead the charge.|But I don't have time to talk about this now.|I'm leaving.",
            "remove_portrait;Ephraim",
            "speak;Kyle;.....;no_talk",
            "speak;Kyle;He says he's going to stop being so reckless, but I know better.|I have to stop him before he gets himself killed...",
            "remove_portrait;Kyle",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank C!",
            "elif;support_rank_nid == 'B'",
            "transition;close;500",
            "change_background;InsideCastle",
            "transition;open;500",
            "add_portrait;Forde;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Kyle;Do you remember what we agreed to last time we talked, Prince Ephraim?",
            "speak;Ephraim;Sigh.|High command must remain behind the vanguard and let the soldiers fight.|And if he tries to take the van, any unit, regardless of rank, may stop him.",
            "speak;Kyle;Yes, exactly.|So you do remember it.",
            "speak;Ephraim;And now, every time I try to lead the charge, my own men stop me!|They waste themselves worrying about my safety when their own is at risk.|Look, I agreed to your plan at the time, but this is just ridiculous.|I'm going to revoke the order.",
            "speak;Kyle;No, Prince!|I know I've told you this before...|But you have to remember, you're the future of Renais-",
            "speak;Ephraim;And if we fail because I do not join the battle, we have no future!|I do know I bear much responsibility, but I simply must revoke the command.",
            "speak;Kyle;I'm sorry, Prince Ephraim, but I can't allow you to do that.|I'm going back to the fight. Make sure you hang back, sire.|Go on.",
            "remove_portrait;Kyle",
            "speak;Ephraim;.....;no_talk",
            "speak;Ephraim;Sigh...|That blasted Kyle.|I know that he's simply concerned about me.|Come to think of it, he's always been like that.|I can't recall a moment when he HASN'T been overly worried about me.|But that order really needs to go.",
            "remove_portrait;Ephraim",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank B!",
            "elif;support_rank_nid == 'A'",
            "transition;close;500",
            "change_background;Town",
            "transition;open;500",
            "multi_add_portrait;Kyle;Right;Forde;Left",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Kyle;My lord prince...|I must apologize.",
            "speak;Ephraim;Why is that, Kyle?|What do you need to apologize for?",
            "speak;Kyle;The other day, I was injured on the battlefield.|You raced to my side without a moment's hesitation.|As I lost consciousness, I heard you say something I won't forget.|“Treat this man as you would my own brother.|Help him, regardless of cost.”",
            "speak;Ephraim;And why must you apologize for that?",
            "speak;Kyle;I ought to have been the one riding to your aid, my lord.|And that you would consider a low-born knight like myself a brother...|All these years, I've thought of myself as nothing but a loyal retainer.|I failed to understand that our bond runs deeper.",
            "speak;Ephraim;.....;no_talk",
            "speak;Ephraim;Since I was a child, you've taught me how to be a warrior.|A prince is raised to be detached.|Distant.|To rule the people from above.|I could not afford to feel any real affection for anyone.|Just Seth, Forde...|And you, Kyle.|You were the only ones.|I realize that much separates us, but I still consider you family.|Although...|you do worry about me too much.|And you have to stop snapping at me.",
            "speak;Kyle;Prince Ephraim, when I was injured the other day, I came to a realization.|I was wrong.|The decision I made you agree to the other day was wrong.|You belong on the front lines, like any of the noble warriors of Renais.|It will do the men's morale good to see you fighting at their side.|From now on, fight as you must!|I will be beside you, and I will protect you as you fight at our side.",
            "speak;Ephraim;Thank you, Kyle.|I was so caught in my worry that I couldn't fight well.|And I will make a concession to you as well.|I will not be so reckless anymore.|I know I have an important position.|Are we in agreement, Kyle?",
            "speak;Kyle;We are, my lord.|Let's ride on together!",
            "speak;Ephraim;Sounds good.|Kyle...|Don't fall behind!",
            "speak;Kyle;Yes, sire!",
            "multi_remove_portrait;Forde;Kyle",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank A!",
            "else",
            "alert;Support increased!",
            "end"
        ],
        "nid": "Global SupportEphraimAndKyle"
    }
]