[
    {
        "name": "DevDesc",
        "trigger": null,
        "level_nid": null,
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "game_var;RNG;game.get_random_choice([ '\"When DEV was born, he spanked the doctor.\"', '\"DEV was once bitten by a snake. After 10 days of agonizing pain, the snake died.\"', '\"When DEV says something wrong, the universe makes it become real by fear.\"', '\"DEV one cried a single tear. Thats how the oceans were made.\"', '\"DEV is immortal, because death is afraid of what will happen if he meets DEV.\"', '\"DEV is never wrong, its only reality who is mistaken.\"', '\"DEV doesnt have a reflection, because mirrors are afraid to not be perfect enough.\"', '\"DEV once threw a rock up. the rock is now known as the moon.\"', '\"when DEV touches a piece of paper, the paper is the one who get a DEV cut.\"', '\"When DEV looks at the sun, its the sun who gets blinded.\"', '\"The only reason ww3 doesnt happen, is because both sides are too afraid DEV might get involved.\"', '\"DEV once punched the ground. the presure was so great that the Earth itself shifted and distorted to release presure. And that is how mountains were made.\"', '\"DEV doesnt do push ups. he pushes the Earth down.\"', '\"DEV once made a snowman with rain.\"', '\"DEV never cut his grass. its simply too afraid to grow.\"', '\"DEV has never cheated death, because he doesnt need to cheat to win.\"', '\"Wherever DEV goes, its always bright, simply because the dark is scared of him\"', '\"DEV once looked at the back of his head with a single mirror\"', '\"DEV won a race against light itself. he only walked.\"', '\"DEV is never late, because time will wait for him.\"', '\"Few people know this, but DEV has never writen a single command in this game, he just stared at it and it programed itself.\"', '\"DEV has counted to infinity. twice.\"', '\"The Earth orbits the sun. The sun orbits the supermassive black hole. And that black hole orbits DEV.\"', '\"DEV knows the answer to all questions, but he thinks we should discover them on our own.\"', '\"DEV one rolled a 6 sided dice. He got a 7\"', '\"DEV never has bad luck, becase nothing that relates to dev is ever bad\"', '\"DEV once shot 7 bullets out of a 5 shot revolver.\"', '\"DEV once trained a waddle of penguins how to fly.\"', '\"A cosmic horror once looked at DEV. It went mad.\"', '\"The power of this emblem was made from a single hair from DEVs head. most people fear what would happen if they added more.\"', '\"A robber once tried to shoot DEV. The robber was found with 2 bullet holes.\"', '\"There is only one thing DEV cant do. lose\"', '\"DEVs blood is a cure all panacea. Too bad he never bleeds.\"', '\"DEV can win tic tac toe with a single move.\"', '\"No one knows how Anna came across this emblem.\"', '\"DEV is not related in any way to chuck norris.\"'])",
            "game_var;DEV;{v:RNG}",
            "",
            "#"
        ],
        "nid": "Global DevDesc"
    }
]