[
    {
        "name": "SupportNatashaAndKnoll",
        "trigger": "on_support",
        "level_nid": null,
        "condition": "check_pair('Natasha','Knoll')",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "if;support_rank_nid == 'C'",
            "transition;close;500",
            "change_background;Clearing",
            "transition;open;500",
            "multi_add_portrait;Natasha;Left;Knoll;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Natasha;Master Knoll...",
            "speak;Knoll;I know you...|You're Natasha, from the temple.",
            "speak;Natasha;Yes.|I remember seeing you many times back in Grado.|But this is the first time we've ever actually spoken.",
            "speak;Knoll;I don't know what it is, but clerics and mages seem to be like oil and water.|And we mages can be an enigmatic bunch at times.|Shadowy and sinister...|Or at least, that's how I've always imagined you clerics saw us.",
            "speak;Natasha;Oh, no!|I never-|Well, no.|You're right.|We had few dealings with the mages.|But that's in the past.|I have a question for you, Master Knoll.",
            "speak;Knoll;I think I can guess.|It's about the Sacred Stones and Prince Lyon, is it?",
            "speak;Natasha;It is.|My mentor died...trying to warn us about the threat our Sacred Stone posed.|I want to know the truth.|What is Emperor Vigarde up to?|What is Prince Lyon's role in this?",
            "speak;Knoll;There are as many truths out there as there are people to tell them.|Perhaps it's best simply to choose the truth with which you are most comfortable.",
            "speak;Natasha;......;no_talk",
            "speak;Knoll;In the eyes of your mentor, I would imagine we must have seemed quite evil.|He imagined our magical studies using the Sacred Stone were sacrilege.|I suspect he quite loathed the ancient magics he called “dark.”",
            "move_portrait;Natasha;MidLeft",
            "speak;Natasha;You're wrong...|My mentor wasn't like that at all!|And isn't this war the direct result of all your dark magic research?",
            "speak;Knoll;......;no_talk",
            "speak;Natasha;......;no_talk",
            "speak;Knoll;Hm...|Well, I suppose you are right about that.|Your magic stems from faith in the unknowable, the divine presence.|In contrast, dark magic stems from knowledge, from understanding.|We distrust what we do not understand, and we strive to know the unknowable.|Perhaps our disciplines truly are incompatible.",
            "speak;Natasha;......;no_talk",
            "multi_remove_portrait;Natasha;Knoll",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank C!",
            "elif;support_rank_nid == 'B'",
            "transition;close;500",
            "change_background;Fort",
            "transition;open;500",
            "multi_add_portrait;Natasha;Left;Knoll;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Knoll;...Our researches ended in miserable failure.|Grado's Sacred Stone was shattered.|Prince Lyon, corrupted...|And this whole tragedy that unfolds around us even now.|It's true.|We mages have triggered this age's greatest calamity.",
            "speak;Natasha;But why?|What was it all for?|What did you hope to accomplish with the power of the Sacred Stone?",
            "speak;Knoll;All Prince Lyon wanted was to help people...and we are his servants.",
            "speak;Natasha;Help people?",
            "speak;Knoll;We read of a spell entitled the time shear.|It causes, in effect, a hole in time.|This spell warps time, punches a hole through cause and effect.",
            "speak;Natasha;......;no_talk",
            "speak;Knoll;We lack the knowledge to reproduce this ancient spell today.|Prince Lyon, however, was convinced that we could unravel its secret.|He felt we could use it to predict-|and even prevent-future events.",
            "speak;Natasha;...Prevent...the future?",
            "speak;Knoll;Oh, we dedicated years to studying this spell.|You see, the greater the disaster, the farther it sends ripples through time.|We learned to read these ripples from the future, hoping to save lives.|If we could know when a disaster would strike, we could evacuate people.|We could save millions of lives.",
            "speak;Natasha;But...|It seems so, so blasphemous.|That worldly creatures should take control of fate, it-",
            "speak;Knoll;Are you saying that, knowing the future, we should do nothing?|We should simply allow people to die in order to preserve “fate”?",
            "speak;Natasha;I...",
            "speak;Knoll;I'm sorry.|I don't mean to sound hostile.|Prince Lyon himself was troubled by these same doubts, you see.|But we pressed on with our studies.|We felt it was our duty, in the interest of all Grado's people.",
            "speak;Natasha;......;no_talk",
            "speak;Knoll;Perhaps we were bitter that we receive no credit for aiding Grado.|That we receive no accolades for our research, for the benefit it brings.|I do not know.|But we pressed on, nonetheless.|The misconceptions linking the ancient magics to “evil” die hard and slow.|Prince Lyon sought to change that.|He wanted, as we all wanted, to prove that our magic had good uses.",
            "speak;Natasha;Prince Lyon would never-",
            "speak;Knoll;With our aid, Prince Lyon predicted a great storm rising in the south.|He barred ships from leaving port, and, oh, how the people complained.|But the storm came, and the seas raged.|We saved countless lives.|And Prince Lyon cared not at all if the people loved him for it.|He only wanted them to be safe.",
            "speak;Natasha;......;no_talk",
            "speak;Knoll;And now, I see it all so clearly.|All our research amounts to nothing.|All I can do now is lament our hunger for knowledge.|Our greed.",
            "multi_remove_portrait;Natasha;Knoll",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank B!",
            "elif;support_rank_nid == 'A'",
            "transition;close;500",
            "change_background;ForestDark",
            "transition;open;500",
            "multi_add_portrait;Natasha;Left;Knoll;Right",
            "#music;09 Distant Roads;300",
            "music;09- Distant Roads Orchestral Cover;500",
            "speak;Natasha;Master Knoll...",
            "speak;Knoll;...Still have questions, do you?|I have told you all that I know.",
            "speak;Natasha;I'm not sure you did.|You said that you could see...ripples of future disasters, is that it?|And the greater the disaster, the more clearly you could read it?|Does that mean you saw something?|Some tremendous disaster to come?",
            "speak;Knoll;......;no_talk",
            "speak;Natasha;And in knowing about the disaster, Lyon thought he could prevent it.|Could he have...|Was he studying the Sacred Stone to find a way to prevent this disaster?",
            "speak;Knoll;And what will you do, now that you know this, too?|Haven't you called such knowledge blasphemous?",
            "speak;Natasha;I...don't know what to do.|If my mentor were here, I think he might be able to guide me.|But I'm still so inexperienced.|I feel lost in this dilemma.",
            "speak;Knoll;......;no_talk",
            "speak;Natasha;But how can I not act on this?|If I do nothing, knowing that something terrible will happen...|If I could have helped... I...|I don't know what to do.",
            "speak;Knoll;...Within five years, half of Grado will be destroyed.",
            "speak;Natasha;Destroyed?",
            "speak;Knoll;In the southern half of the continent, there will be a terrible quake.|The ground will shake violently.|The earth will crack open wide.|Cities will fall.|Fields will burn in the earth's hot blood.|Few will survive.|This is what we have foreseen.",
            "speak;Natasha;How-|How can this-",
            "speak;Knoll;I advise you to leave Grado.|You might be able to escape the disaster if you head north to Renais or Frelia.",
            "speak;Natasha;No...|I can't do that.|When this disaster strikes, people will need help and healing.|If I could help them even a little by staying behind...",
            "speak;Knoll;You would willingly risk certain death to save a handful of people?",
            "speak;Natasha;If I died serving Grado, I would have no regrets, Master Knoll.|Thank you for sharing this.|I will make the most of this knowledge.",
            "speak;Knoll;.....;no_talk",
            "speak;Knoll;Spoken like a true cleric.|You would drop everything without hesitation just to help others.|This is the difference between mages and priests.|Knowledge versus sacrifice.|Perhaps you might allow me to join you when the time comes...",
            "speak;Natasha;Master Knoll?",
            "speak;Knoll;If I am to honor Prince Lyon's intentions, I cannot flee this.|I am not sure how best I can help, but I do not want anyone to die.|Not if, by my action, I can save them.",
            "speak;Natasha;I understand how you feel, Master Knoll...|Let our strengths be united, then, for the common good.",
            "multi_remove_portrait;Natasha;Knoll",
            "music_fade_back",
            "transition;close;500",
            "change_background",
            "transition;open;500",
            "sound;Item",
            "alert;Reached rank A!",
            "else",
            "alert;Support increased!",
            "end"
        ],
        "nid": "Global SupportNatashaAndKnoll"
    }
]